docs/diagrams/data-model.mmd
erDiagram
    users {
        UUID user_id PK
        string email
        string pass_hash
        datetime created_at
        boolean is_active
        datetime deleted_at
        UUID deleted_by
    }

    roles {
        UUID role_id PK
        string name
        string description
        datetime created_at
        datetime deleted_at
        UUID deleted_by
        boolean is_active
    }

    permissions {
        UUID permission_id PK
        string name
        string description
        datetime created_at
        datetime deleted_at
        UUID deleted_by
        boolean is_active
    }

    tasks {
        UUID task_id PK
        string mtitle
        string description
        string status
        boolean is_active
        datetime created_at
        datetime due_at
        datetime deleted_at
        UUID deleted_by
    }

    task_assignment {
        UUID _id PK
        UUID user_id FK
        UUID task_id FK
        datetime assigned_at
        string assignment_role
    }

    user_roles {
        UUID _id PK
        UUID user_id FK
        UUID role_id FK
    }

    role_permissions {
        UUID _id PK
        UUID role_id FK
        UUID permission_id FK
    }

    user_permissions {
        UUID _id PK
        UUID user_id FK
        UUID permission_id FK
    }

    audit_logs {
        UUID log_id PK
        UUID user_id FK
        string action
        string entity_name
        UUID entity_id
        datetime timestamp
        string old_values
        string new_values
        datetime created_at
    }

    users ||--o{ user_roles : has
    roles ||--o{ user_roles : has

    roles ||--o{ role_permissions : has
    permissions ||--o{ role_permissions : has

    users ||--o{ user_permissions : has
    permissions ||--o{ user_permissions : has

    users ||--o{ task_assignment : has
    tasks ||--o{ task_assignment : has

    users ||--o{ audit_logs : creates
